IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_flash_ctrl_regs.xml
<module id="FLASH_CTRL_REGS" HW_revision="" description="FLASH CTRL Registers">
	<register id="FRDCNTL" width="32" page="1" offset="0x0" internal="0" description="Flash Read Control Register">
		<bitfield id="RWAIT" description="Random Read Waitstate" begin="11" end="8" width="4" rwaccess="RW"/>
	</register>
	<register id="FLPROT" width="32" page="1" offset="0x4" internal="0" description="Flash program/erase protect register">
		<bitfield id="FLWEPROT" description="Flash write/erase protect bit." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="FRD_INTF_CTRL" width="32" page="1" offset="0x180" internal="0" description="Flash Read Interface Control Register">
		<bitfield id="PREFETCH_EN" description="Prefetch Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_CACHE_EN" description="Data Cache Enable" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
